#### AdaptiveComponentFamilyUtils Members

---

|  |
| --- |
| AdaptiveComponentFamilyUtils Class   Methods   See Also |

The  AdaptiveComponentFamilyUtils  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetNumberOfAdaptivePoints | Gets number of Adaptive Point Elements in Adaptive Component Family. |
| Public method Static member | GetNumberOfPlacementPoints | Gets number of Placement Point Elements in Adaptive Component Family. |
| Public method Static member | GetNumberOfShapeHandlePoints | Gets number of Shape Handle Point Elements in Adaptive Component Family. |
| Public method Static member | GetPlacementNumber | Gets Placement number of an Adaptive Placement Point. |
| Public method Static member | GetPointConstraintType | Gets constrain type of an Adaptive Shape Handle Point. |
| Public method Static member | GetPointOrientationType | Gets orientation type of an Adaptive Placement Point. |
| Public method Static member | IsAdaptiveComponentFamily | Verifies if the Family is an Adaptive Component Family. |
| Public method Static member | IsAdaptivePlacementPoint | Verifies if the Reference Point is an Adaptive Placement Point. |
| Public method Static member | IsAdaptivePoint | Verifies if the Reference Point is an Adaptive Point. |
| Public method Static member | IsAdaptiveShapeHandlePoint | Verifies if the Reference Point is an Adaptive Shape Handle Point. |
| Public method Static member | MakeAdaptivePoint | Makes Reference Point an Adaptive Point or makes an Adaptive Point a Reference Point. |
| Public method Static member | SetPlacementNumber | Sets Placement Number of an Adaptive Placement Point. |
| Public method Static member | SetPointConstraintType | Sets constrain type of an Adaptive Shape Handle Point. |
| Public method Static member | SetPointOrientationType | Sets orientation type of an Adaptive Placement Point. |

# See Also

AdaptiveComponentFamilyUtils Class

Autodesk.Revit.DB Namespace